update diagrams
